# GBXMLExport Options Methods

Source: https://www.revitapidocs.com/2026/54ecedd9-9222-9aee-8fdd-110e6f0b54a8.htm

---

| GBXMLExport Options Methods |
| --- |

The GBXMLExportOptions type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace